.artifacts/m3/jset-server-20260717/ab-l1-r2-set-rep2.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    18158303 ops, 1856808 (avg: 1815544) ops/sec, 1.84GB/sec (avg: 1.80GB/sec),  0.86 (avg:  0.88) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1815398.27          ---          ---         0.87995         0.83100         1.70300         2.17500   1889661.25 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1815398.27         0.00         0.00         0.87995         0.83100         1.70300         2.17500   1889661.25