.artifacts/m3/jset-server-20260717/ab-l1-r2-set-rep3.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    17375305 ops, 1808510 (avg: 1737251) ops/sec, 1.80GB/sec (avg: 1.72GB/sec),  0.88 (avg:  0.92) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1737307.80          ---          ---         0.91962         0.88700         1.92700         2.51100   1808376.40 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1737307.80         0.00         0.00         0.91962         0.88700         1.92700         2.51100   1808376.40