.artifacts/m3/jset-server-20260717/ab-l1-r2-set-warm.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    18423516 ops, 1866121 (avg: 1842065) ops/sec, 1.85GB/sec (avg: 1.83GB/sec),  0.86 (avg:  0.87) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1842144.25          ---          ---         0.86705         0.82300         1.74300         3.18300   1917501.35 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1842144.25         0.00         0.00         0.86705         0.82300         1.74300         3.18300   1917501.35