.artifacts/m3/jset-server-20260717/jset-1k-perfleg.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads 25 conns:    25014509 ops, 1216611 (avg: 1250563) ops/sec, 1.22GB/sec (avg: 1.26GB/sec),  1.31 (avg:  1.28) msec latency

4         Threads
25        Connections per thread
20        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.sets   1250482.96         0.00         0.00         1.27809         1.23900         2.46300         3.53500   1316290.86 
Totals      1250482.96         0.00         0.00         1.27809         1.23900         2.46300         3.53500   2632581.72