.artifacts/m3/jset-server-20260717/set-1k-perfleg.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads 25 conns:    36234664 ops, 1858683 (avg: 1811592) ops/sec, 1.85GB/sec (avg: 1.80GB/sec),  0.86 (avg:  0.88) msec latency

4         Threads
25        Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1811630.68          ---          ---         0.88168         0.83900         1.83100         2.43100   1885739.46 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1811630.68         0.00         0.00         0.88168         0.83900         1.83100         2.43100   1885739.46